//     1) Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох.
//     Також потрібно врахувати коли введені рівні числа.

//      let x=+prompt('Enter x');
//      let y=+prompt('Enter y');
//      if (x>y) {
//      console.log(x)
//      }
//      else if (y>x) {
//      console.log(y)
//      }
//      else if (x===y) {
//      console.log('Numbers are equal to')
//      }
//      else{
//      console.log('END')
//      }


//      2) У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//      Користувач вводить номер квартири просто в змінні або через prompt('').
//      Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

//      let number = +prompt('Введіть номер квартири!');
//      if (number >= 1 && number <= 20){
//      console.log('Квартира знаходиться в першому під`їзді');
//      }
//      else if (number >= 21 && number <= 48) {
//      console.log('Квартира знаходиться в другому під`їзді');
//      }
//      else if (number >= 49 && number <= 90) {
//      console.log('Квартира знаходиться в третьому під`їзді');
//      }
//      else{
//      console.log('Не існує такої квартири');
//      }

//      3) Ми маємо змінну number в яку користувач задає числове значення, якщо змінна дорівнює 10 вивести повідомлення ВІРНО,
//      якщо змінна не рівна 10 - тоді НЕ ВІРНО

//      let number = +prompt('Введіть число!');
//      if (number === 10) {
//      console.log('Вірно');
//      }
//      else{
//      console.log('Не вірно');
//      }

//      let number = +prompt('Введіть число!');
//      (number === 10) ?  console.log('Вірно!') : console.log('Не вірно!');

//      4) Задача-гра "чи ми йдемо сьогодні в ОКТЕН на навчання?".
//      Змінна, яка характеризує температуру. Якщо температура від +10 до +22
//      вивести повідомлення що ми йдемо ВЧИТИСЯ.
//      Якщо інша температура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

//      let temp = prompt('Введіть температуру');
//      (temp >= 10 && temp <=22) ? console.log('ми йдемо ВЧИТИСЯ') : console.log('В такому випадку сидітимемо в дома і вчитимемося онлайн');

//      5) За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
//      І в залежності від введеного числа нам дається приз.
//      (Авто, Мотоцикл, Телефон, і т.д) і якщо число не підходить тоді вивести Повідомлення - що число не вірне ... .

//      let game = +prompt("Введіть число від 1 до 5");
//      switch(game)
//      {
//      case 1:
//      alert("Вітаннячка ви виграли поїздку в Китай");
//      break;
//
//      case 2:
//      alert("Вітаннячка ви виграли 1000$");
//      break;
//
//      case 3:
//      alert("Вітаннячка ви виграли 1000$");
//      break;
//
//      case 4:
//      alert("Вітаннячка ви виграли 1000$");
//      break;
//
//      case 5:
//      alert("Вітаннячка ви виграли 1000$");
//      break;
//
//      default:
//      alert("Ви вказали неправильне число");
//      }
